46-redux-review/backend/app/controllers/application_controller.rb

SELECT  "pandas".* FROM "pandas" WHERE "pandas"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def current_panda
    if decoded_token
      panda_id = decoded_token["panda_id"]
      Panda.find(panda_id)