46-redux-review/backend/app/controllers/auth_controller.rb

    def create
      panda = Panda.find_by(username: params[:username])
---
SELECT  "pandas".* FROM "pandas" WHERE "pandas"."username" = ? LIMIT ?  [["username", "joshpanda"], ["LIMIT", 1]]