46-redux-review/backend/app/controllers/pandas_controller.rb

INSERT INTO "pandas" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-11-01 23:45:50.311537"], ["updated_at", "2018-11-01 23:45:50.311537"]]
---
    def create
        panda = Panda.create(panda_params)

SELECT "pandas".* FROM "pandas"
---
    def index
        render json: Panda.all

SELECT  "pandas".* FROM "pandas" WHERE "pandas"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def show
        panda = Panda.find(params[:id])

SELECT  "pandas".* FROM "pandas" WHERE "pandas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "pandas" WHERE "pandas"."id" = ?  [["id", 1]]
---
    def destroy
        panda = Panda.find(params[:id])
        panda.destroy